## 文件操作

- 这是一个关于淘宝母婴产品的用户消费行为数据集，然后基于这个数据集，做数据清洗

### 1. CSV文件读写

In [2]:
import pandas as pd
import numpy as np

In [4]:
#设置最大显示列数
pd.set_option('display.max_columns',20)

#设置最大显示行数
pd.set_option('display.max_rows',100)

In [5]:
#婴儿信息表;默认将第一行作为表头，一般用utf-8编码
baby = pd.read_csv('../data/sam_tianchi_mum_baby.csv',encoding='utf-8')

In [6]:
baby.head(3)

   user_id  birthday  gender
0     2757  20130311       1
1   415971  20121111       0
2  1372572  20120130       1

In [7]:
#订单数据；gbk中文编码
order = pd.read_csv('../data/meal_order_info.csv',encoding='gbk',dtype={'info_id':str,'emp_id':str})

In [9]:
order.head(2)

,info_id,emp_id,number_consumers,mode,dining_table_id,dining_table_name,expenditure,dishes_count,accounts_payable,use_start_time,...,lock_time,cashier_id,pc_id,order_number,org_id,print_doc_bill_num,lock_table_info,order_status,phone,name
0,417,1442,4,NaN,1501,1022,165,5,165,2016/8/1 11:05:36,...,2016/8/1 11:11:46,NaN,NaN,NaN,330,NaN,NaN,1,18688880641,苗宇怡
1,301,1095,3,NaN,1430,1031,321,6,321,2016/8/1 11:15:57,...,2016/8/1 11:31:55,NaN,NaN,NaN,328,NaN,NaN,1,18688880174,赵颖

In [11]:
#交易表;nrows=10读取前10行
baby_trade_history = pd.read_csv('../data/baby_trade_history.csv',nrows=10)
baby_trade_history

,user_id,auction_id,cat_id,cat1,property,buy_mount,day
0,786295544,41098319944,50014866,50022520,21458:86755362;13023209:3593274;10984217:21985...,2,20140919
1,532110457,17916191097,50011993,28,21458:11399317;1628862:3251296;21475:137325;16...,1,20131011
2,249013725,21896936223,50012461,50014815,21458:30992;1628665:92012;1628665:3233938;1628...,1,20131011
3,917056007,12515996043,50018831,50014815,21458:15841995;21956:3494076;27000458:59723383...,2,20141023
4,444069173,20487688075,50013636,50008168,21458:30992;13658074:3323064;1628665:3233941;1...,1,20141103
5,152298847,41840167463,121394024,50008168,21458:3408353;13023209:727117752;22009:2741771...,1,20141103
6,513441334,19909384116,50010557,50008168,25935:21991;1628665:29784;22019:34731;22019:20...,1,20121212
7,297411659,13540124907,50010542,50008168,21458:60020529;25935:31381;1633959:27247291;16...,1,20121212
8,82830661,19948600790,50013874,28,21458:11580;21475:137325,1,20121101
9,475046636,10368360710,203527,28,22724:40168;22729:40278;21458:21817;2770200:24...,1,20121101

- 保存数据

In [12]:
#建议用utf-8或者中文gbk编码默认utf-8，index=False表示不写出索引行
baby_trade_history.to_csv('../data/bthc.csv',encoding='utf-8',index=False)

### 2. excel文件读写

In [13]:
#订单数据;sheet_name=0,表示第几个工作薄
dfe2 = pd.read_excel('../data/meal_order_detail.xlsx',encoding='utf-8',sheet_name=0)

In [14]:
dfe2.head(2)

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿\r\n\r\n\r\n,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442

In [22]:
#保存数据sheet_name='one',即工作薄名字
dfe2.to_excel('../data/dfe2.xlsx',sheet_name='one',index=False)

### 3. 数据库文件读写

In [23]:
import pymysql
from sqlalchemy import create_engine

- 按实际情况依次填写MySQL的用户名、密码、IP地址、端口、数据库名
- create_engine('mysql+pymysql://user:passward@IP:3306/test01')
    - root 用户名
    - passward --密码
    - IP : 服务区IP
    - 3306： 端口号
    - FileOperations :数据库名称
- 建库
    - mysql> create database FileOperations charset 'utf8';

In [31]:
#建立连接
coon = create_engine('mysql+pymysql://root:password@localhost:3306/数据库')

- conn = create_engine("mysql+pymysql://{}:{}@{}:{}/{}?charset=gbk".format('root', 'password', 'localhost', '3306', '数据库名'))

In [34]:
#读取数据；选择数据库中表的名称
sql = 'select * from chinaAdd'
df1 = pd.read_sql(sql,coon)
df1

,id,confirm,dead,heal,nowConfirm,suspect,nowSevere,importedCase,create_dt
0,1,39,13,936,-910,-6,-202,20,2020-03-17 10:39:16

In [35]:
#函数
def querty(table):
    host = 'localhost'
    user = 'root'
    password = 'password'
    database = '数据库'
    port = 3306
    conn = create_engine("mysql+pymysql://{}:{}@{}:{}/{}".format(user, password, host, port, database))
    #sql语句，可以定制，实现灵活查询;table:选择数据库中表名称
    sql = 'select * from '+ table
    #使用pandas的read_sql函数直接将数据存dataframe中
    results = pd.read_sql(sql,coon)
    return results

In [37]:
df2 = querty('chinaAdd')
df2

,id,confirm,dead,heal,nowConfirm,suspect,nowSevere,importedCase,create_dt
0,1,39,13,936,-910,-6,-202,20,2020-03-17 10:39:16

- 数据保存
    - df.to_sql(name, con=engine, if_exists='replace/append/fail',index=False)
    - name是表名
    - con是连接
    - if_exists：表如果存在怎么处理 -- append：追加 -- replace：删除原表，建立新表再添加 -- fail：什么都不干
    - index=False：不插入索引index

In [38]:
dfc = pd.read_csv('../data/baby_trade_history.csv')

In [39]:
try:
    dfc.to_sql('数据库名',con=coon,index=False,if_exists='replace')
except:
    print('error')

error

Python是否能将数据写入数据库，很多时候取决于数据库的权限